SQL/URLShortener/app/models/shortened_url.rb

    def self.new_url (user, longUrl)
        ShortenedUrl.create!(user_id: user.id, long_url: longUrl, short_url: ShortenedUrl.random_code)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def num_uniques      # determine the number of distinct users who have clicked a link.
        # visits.select(:user_id).distinct.count ==>  one solution: as visits users are NOT unique
        # simple sol. using unique visitors
        visitors.length
---
SELECT "shortened_urls".* FROM "shortened_urls" ORDER BY "shortened_urls"."id" DESC LIMIT $1  [["LIMIT", 1]]