SQL/URLShortener/app/models/shortened_url.rb

    def self.create_for_user_and_long_url! (user, longUrl)
        ShortenedUrl.create!(user_id: user.id, long_url: longUrl, short_url: ShortenedUrl.random_code)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "new_user@gmail.com"], ["short_url", "hkGcE-RHADu9-H0mJstmwg"], ["user_id", 4], ["created_at", "2021-09-23 11:10:31.941232"], ["updated_at", "2021-09-23 11:10:31.941232"]]
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.fishes.com"], ["short_url", "yQdkFBlN-NpnCMw1Wqfs-g"], ["user_id", 4], ["created_at", "2021-09-23 15:47:45.489599"], ["updated_at", "2021-09-23 15:47:45.489599"]]